---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.PathFailures
source: html/bf3f404c-1275-b2eb-532b-70c866b9cc91.htm
---
# BuiltInFailures.PathFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.